:PROPERTIES:
#+TITLE: U.S.-Liberia Trade
:END:
* Set up 

#+BEGIN_SRC R :results output :session
# install.packages(c("htlmtab", "lubridate", "knitr", "formattable"))
library(tidyverse)
library(lubridate)
library(knitr)
library(readxl)
library(httr)
library(formattable)

setwd("~/OneDrive/03 Resources/Data/Census-trade/")

url <- 'https://www.census.gov/foreign-trade/balance/country.xlsx'
GET(url, write_disk(TF <- tempfile(fileext = ".xlsx")))
countries <- read_excel(TF)
countries <- as_tibble(countries)
attach(countries)
#+END_SRC

* U.S. imports from Liberia by year

#+BEGIN_SRC R :session :results output

countries_long <- countries %>%
  pivot_longer(!year:CTYNAME,
               names_to = c("TYPE","MONTH"),
               names_pattern = "^(\\D)(\\D\\D\\D)",
               values_to = "AMOUNT"
               ) %>%
  rename(YEAR = year)
imports <- filter(countries_long, TYPE=="I" & CTYNAME=="Liberia")
imports_by_year <- imports %>% group_by(YEAR) %>% summarise(TOTAL = sum(AMOUNT))
kable(imports_by_year, digits=1)

#+END_SRC

#+RESULTS:
#+begin_example


|YEAR |     TOTAL|
|:----|---------:|
|1992 |  12.30000|
|1993 |   3.00000|
|1994 |   3.40000|
|1995 |   9.90000|
|1996 |  26.90000|
|1997 |   4.70000|
|1998 |  25.10000|
|1999 |  30.50000|
|2000 |  45.50000|
|2001 |  42.50000|
|2002 |  45.70000|
|2003 |  59.48540|
|2004 |  84.33088|
|2005 |  90.82726|
|2006 | 139.93412|
|2007 | 115.20140|
|2008 | 143.46159|
|2009 |  80.39024|
|2010 | 180.01040|
|2011 | 158.18025|
|2012 | 144.01345|
|2013 |  96.53277|
|2014 |  83.39446|
|2015 |  44.93610|
|2016 |  64.12797|
|2017 |  91.18299|
|2018 |  61.55335|
|2019 |  65.64343|
|2020 |  45.11710|
|2021 |  39.95105|
#+end_example

* U.S. exports to Liberia by year

#+BEGIN_SRC R :session :results output

exports <- filter(countries_long, TYPE=="E" & CTYNAME=="Liberia")
exports_by_year <- exports %>% group_by(YEAR) %>% summarise(TOTAL = sum(AMOUNT))
kable(exports_by_year)

#+END_SRC

#+RESULTS:
#+begin_example


|YEAR |     TOTAL|
|:----|---------:|
|1992 |  30.60000|
|1993 |  39.10000|
|1994 |  46.40000|
|1995 |  41.70000|
|1996 |  49.80000|
|1997 |  42.80000|
|1998 |  50.30000|
|1999 |  44.80000|
|2000 |  43.00000|
|2001 |  36.60000|
|2002 |  27.80000|
|2003 |  33.31374|
|2004 |  60.91460|
|2005 |  69.32032|
|2006 |  67.84034|
|2007 |  75.76950|
|2008 | 156.68775|
|2009 |  94.74525|
|2010 | 191.35178|
|2011 | 195.20782|
|2012 | 241.08909|
|2013 | 173.20763|
|2014 | 184.50271|
|2015 | 135.81555|
|2016 | 158.02015|
|2017 | 138.34064|
|2018 | 196.66887|
|2019 | 113.87365|
|2020 |  93.17783|
|2021 |  63.94347|
#+end_example

* Imports and exports combined

#+BEGIN_SRC R :session :results output

merged <- merge(imports_by_year, exports_by_year, by="YEAR")
names(merged) <- c("YEAR", "IMPORTS", "EXPORTS")

merged$BALANCE <- merged$EXPORTS - merged$IMPORTS
merged$YEAR <- parse_date_time(merged$YEAR, "Y")
merged_tbl <- merged
write.csv(merged_tbl, "merged_tbl.csv")
kable(merged_tbl, digits=1)

#+END_SRC

#+RESULTS:
#+begin_example


|YEAR       | IMPORTS| EXPORTS| BALANCE|
|:----------|-------:|-------:|-------:|
|1992-01-01 |    12.3|    30.6|    18.3|
|1993-01-01 |     3.0|    39.1|    36.1|
|1994-01-01 |     3.4|    46.4|    43.0|
|1995-01-01 |     9.9|    41.7|    31.8|
|1996-01-01 |    26.9|    49.8|    22.9|
|1997-01-01 |     4.7|    42.8|    38.1|
|1998-01-01 |    25.1|    50.3|    25.2|
|1999-01-01 |    30.5|    44.8|    14.3|
|2000-01-01 |    45.5|    43.0|    -2.5|
|2001-01-01 |    42.5|    36.6|    -5.9|
|2002-01-01 |    45.7|    27.8|   -17.9|
|2003-01-01 |    59.5|    33.3|   -26.2|
|2004-01-01 |    84.3|    60.9|   -23.4|
|2005-01-01 |    90.8|    69.3|   -21.5|
|2006-01-01 |   139.9|    67.8|   -72.1|
|2007-01-01 |   115.2|    75.8|   -39.4|
|2008-01-01 |   143.5|   156.7|    13.2|
|2009-01-01 |    80.4|    94.7|    14.4|
|2010-01-01 |   180.0|   191.4|    11.3|
|2011-01-01 |   158.2|   195.2|    37.0|
|2012-01-01 |   144.0|   241.1|    97.1|
|2013-01-01 |    96.5|   173.2|    76.7|
|2014-01-01 |    83.4|   184.5|   101.1|
|2015-01-01 |    44.9|   135.8|    90.9|
|2016-01-01 |    64.1|   158.0|    93.9|
|2017-01-01 |    91.2|   138.3|    47.2|
|2018-01-01 |    61.6|   196.7|   135.1|
|2019-01-01 |    65.6|   113.9|    48.2|
|2020-01-01 |    45.1|    93.2|    48.1|
|2021-01-01 |    40.0|    63.9|    24.0|
#+end_example

* Charts

**  U.S. trade balance with Liberia by year

#+BEGIN_SRC R :session :results output graphics file: c:/users/schav/onedrive/notes/balance.png :exports results

merged_tbl$YEAR <- format(as.Date(merged$YEAR, format="%Y-%m-%d"),"%Y")
ggplot(merged, aes(x = YEAR, y = BALANCE)) +
    geom_bar(stat="identity") +
    labs(x ="Year", y = "Trade balance in U.S. dollars (millions)") +
    theme_minimal()

#+END_SRC

** Imports from Liberia (in millions)

#+BEGIN_SRC R :session :results output

ggplot(merged, aes(x = YEAR, y = IMPORTS)) +
  geom_line() +
  labs(x = "Year", y = "Imports in U.S. dollars (millions)") +
  theme_minimal()

#+END_SRC

#+RESULTS:

** Exports to Liberia (in millions)

#+BEGIN_SRC R :session :results output

ggplot(merged, aes(x = YEAR, y = EXPORTS)) +
  geom_line() +
  labs(x = "Year", y = "Exports in U.S. dollars (millions)") +
  theme_minimal()

#+END_SRC

** Top 20 U.S. products exported to Liberia, 2011-2020 (U.S. dollars)

#+BEGIN_SRC R :session :results output

url <- 'https://www.census.gov/foreign-trade/statistics/product/enduse/exports/enduse_exports.xlsx'
GET(url, write_disk(TF <- tempfile(fileext = ".xlsx")))
end_exports <- read_excel(TF)
end_exports <- as_tibble(end_exports)
attach(end_exports)

#+END_SRC

#+BEGIN_SRC R :session :results output


end_ex_long <- end_exports %>%
  pivot_longer(!CTY_CODE:COMM_DESC,
               names_to = "YEAR",
               names_pattern = "value_(\\d\\d)",
               values_to = "TOTAL"
               )
write.csv(end_ex_long, "end_ex_long.csv")


end_ex_long$YEAR <- sub("^", "20", end_ex_long$YEAR)
end_ex_long$YEAR <- parse_date_time(end_ex_long$YEAR, "Y")

ex_detail <- filter(end_ex_long, CTY_DESC=="Liberia")

end_ex_by_year <- ex_detail %>%
                  group_by(COMM_DESC) %>%
                  summarise(TOTAL =
                  sum(TOTAL)) %>%
                  arrange(desc(TOTAL))

top_20_ex <- head(end_ex_by_year, 20)
top_20_ex$TOTAL <-  currency(top_20_ex$TOTAL, digits = 0L)
top_20_ex <- rename(top_20_ex, EXPORT = COMM_DESC)
kable(top_20_ex)

#+END_SRC

** Top 20 U.S. products imported from Liberia, 2011-2020 (U.S. dollars)

#+BEGIN_SRC R :session :results output

url <- 'https://www.census.gov/foreign-trade/statistics/product/enduse/imports/enduse_imports.xlsx'
GET(url, write_disk(TF <- tempfile(fileext = ".xlsx")))
end_imports <- read_excel(TF)
end_imports <- as_tibble(end_imports)
attach(end_imports)

#+END_SRC

#+BEGIN_SRC R :session :results output

end_im_long <- end_imports %>%
  pivot_longer(!CTY_CODE:COMM_DESC,
               names_to = "YEAR",
               names_pattern = "value_(\\d\\d)",
               values_to = "TOTAL"
               )
write.csv(end_im_long, "end_im_long.csv")

end_im_long$YEAR <- sub("^", "20", end_im_long$YEAR)
end_im_long$YEAR <- parse_date_time(end_im_long$YEAR, "Y")

im_detail <- filter(end_im_long, CTY_DESC=="Liberia")

end_im_by_year <- im_detail %>%
                  group_by(COMM_DESC) %>%
                  summarise(TOTAL =
                  sum(TOTAL)) %>%
                  arrange(desc(TOTAL))

top_20_im <- head(end_im_by_year, 20)
top_20_im$TOTAL <-  currency(top_20_im$TOTAL, digits = 0L)
top_20_im <- rename(top_20_im, IMPORT = COMM_DESC)
kable(top_20_im)

#+END_SRC

#+RESULTS:
#+begin_example


|IMPORT                                        |        TOTAL|
|:---------------------------------------------|------------:|
|Natural rubber                                | $767,293,303|
|U.S. goods returned, and reimports            |  $48,669,582|
|Sulfur, nonmetallic minerals                  |  $11,864,409|
|Gem diamonds                                  |  $10,497,980|
|Food oils, oilseeds                           |   $4,917,110|
|Artwork, antiques, stamps, etc.               |   $4,454,875|
|Lumber                                        |     $829,873|
|Cell phones and other household goods, n.e.c. |     $729,439|
|Semiconductors                                |     $705,627|
|Nonmonetary gold                              |     $548,560|
|Minimum value shipments                       |     $523,140|
|Gem stones, other                             |     $498,379|
|Pharmaceutical preparations                   |     $210,985|
|Petroleum products, other                     |     $200,279|
|Chemicals-other, n.e.c.                       |     $171,395|
|Other parts and accessories of vehicles       |     $164,138|
|Cocoa beans                                   |     $161,011|
|Photo, service industry machinery             |     $159,024|
|Synthetic rubber--primary                     |     $148,952|
|Numismatic coins                              |     $132,947|
#+end_example

** Liberian rubber exports to U.S.

#+BEGIN_SRC R :session :results output

rubber <- im_detail %>%
        filter(COMM_DESC == 'Natural rubber')
ggplot(rubber, aes(x = YEAR, y = TOTAL)) +
        geom_line () +
        labs(x = 'Year', y = 'Exports to U.S. (in U.S. dollars)') +
        scale_y_continuous(labels = scales::dollar) + 
        theme_minimal()

rubber_tbl <- rubber
rubber_tbl$YEAR <- format(as.Date(rubber_tbl$YEAR, format="%Y-%m-%d"),"%Y")
rubber_tbl$TOTAL <-  currency(rubber_tbl$TOTAL, digits = 0L) 
kable(select(rubber_tbl, YEAR, TOTAL), format.args = list(big.mark = ","))

#+END_SRC

#+RESULTS:
#+begin_example


|YEAR |        TOTAL|
|:----|------------:|
|2011 | $156,754,793|
|2012 | $142,848,717|
|2013 |  $91,242,140|
|2014 |  $73,396,277|
|2015 |  $41,155,589|
|2016 |  $41,143,163|
|2017 |  $59,409,074|
|2018 |  $56,124,030|
|2019 |  $61,563,489|
|2020 |  $43,656,031|
#+end_example

* Source

[[https://www.census.gov/foreign-trade/balance/c7650.html][U.S. Census Bureau]]


